"""
1. Поработайте с переменными, создайте несколько, выведите на экран,
запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
"""

# Внимание, уважаемый реподаватель, месяц назад я прошел этот же курс с вами, поэтому не вижу смысл расписывать легкие задания
# ну и плюс вы не рекомендовали использовать знания больше чем с первого урока, поэтому нет try expect , а while true как-то скучно как по мне

str_example = input('Введите что угодно ')
int_example = int(input('Введите ваш возраст числом: '))

print (f'str - {int_example}\nint - {int_example}')